In [1]:
dict = {"country": ["Brazil", "Russia", "India", "China", "South Africa"],
       "capital": ["Brasilia", "Moscow", "New Dehli", "Beijing", "Pretoria"],
       "area": [8.516, 17.10, 3.286, 9.597, 1.221],
       "population": [200.4, 143.5, 1252, 1357, 52.98] }

import pandas as pd
b=pd.DataFrame(dict)
print(b)

        country    capital    area  population
0        Brazil   Brasilia   8.516      200.40
1        Russia     Moscow  17.100      143.50
2         India  New Dehli   3.286     1252.00
3         China    Beijing   9.597     1357.00
4  South Africa   Pretoria   1.221       52.98

In [2]:
print(pd.__version__)

0.25.1

In [3]:
d={1:[1,3,4,5],3:[4,5,4,3]}
a=pd.DataFrame(d)
print(a)

   1  3
0  1  4
1  3  5
2  4  4
3  5  3

In [4]:
d={"company":["amazon","apple","google","facebook","microsoft"],"CEO":["jef bezos","tim cook","sundar pichai","mark Zukerberg","satya nadella"],"founded":[1994,1976,1998,2004,1975]}
v=pd.DataFrame(d)
v.index=["a.","b.","c.","d.","e."]
print(v)

      company             CEO  founded
a.     amazon       jef bezos     1994
b.      apple        tim cook     1976
c.     google   sundar pichai     1998
d.   facebook  mark Zukerberg     2004
e.  microsoft   satya nadella     1975

In [5]:
d={"company":["amazon","apple","google","facebook","microsoft"],"CEO":["jef bezos","tim cook","sundar pichai","mark Zukerberg","satya nadella"],"founded":[1994,1976,1998,2004,1975]}
v=pd.DataFrame(d)
v.index=[int(i) for i in range(1,6)]
print(v["company"])

1       amazon
2        apple
3       google
4     facebook
5    microsoft
Name: company, dtype: object

In [6]:
d={"company":["amazon","apple","google","facebook","microsoft"],"CEO":["jef bezos","tim cook","sundar pichai","mark Zukerberg","satya nadella"],"founded":[1994,1976,1998,2004,1975]}
v=pd.DataFrame(d)
v.index=[int(i) for i in range(1,6)]
print(v.columns)

Index(['company', 'CEO', 'founded'], dtype='object')

In [7]:
d={"company":["amazon","apple","google","facebook","microsoft"],"CEO":["jef bezos","tim cook","sundar pichai","mark Zukerberg","satya nadella"],"founded":[1994,1976,1998,2004,1975]}
v=pd.DataFrame(d)
v.index=[int(i) for i in range(1,6)]
print(v.shape)

(5, 3)

In [8]:
d={"company":["amazon","apple","google","facebook","microsoft"],"CEO":["jef bezos","tim cook","sundar pichai","mark Zukerberg","satya nadella"],"founded":[1994,1976,1998,2004,1975]}
v=pd.DataFrame(d)
v.index=[int(i) for i in range(1,6)]
print(v[0:4])
print(v[["company","founded"]])

    company             CEO  founded
1    amazon       jef bezos     1994
2     apple        tim cook     1976
3    google   sundar pichai     1998
4  facebook  mark Zukerberg     2004
     company  founded
1     amazon     1994
2      apple     1976
3     google     1998
4   facebook     2004
5  microsoft     1975

In [9]:
d={"company":["amazon","apple","google","facebook","microsoft"],"CEO":["jef bezos","tim cook","sundar pichai","mark Zukerberg","satya nadella"],"founded":[1994,1976,1998,2004,1975]}
v=pd.DataFrame(d)
v.set_index("founded",inplace=True)

print(v)

           company             CEO
founded
1994        amazon       jef bezos
1976         apple        tim cook
1998        google   sundar pichai
2004      facebook  mark Zukerberg
1975     microsoft   satya nadella

In [10]:
d={"company":["amazon","apple","google","facebook","microsoft"],"CEO":["jef bezos","tim cook","sundar pichai","mark Zukerberg","satya nadella"],"founded":[1994,1976,1998,2004,1975]}
v=pd.DataFrame(d)
v.index=[int(i) for i in range(1,6)]
print(v.size)
v.set_index("founded",inplace=False)

print(v)

15
     company             CEO  founded
1     amazon       jef bezos     1994
2      apple        tim cook     1976
3     google   sundar pichai     1998
4   facebook  mark Zukerberg     2004
5  microsoft   satya nadella     1975

In [11]:
import pandas as pd
d={"company":["amazon","apple","google","facebook","microsoft"],"CEO":["jef bezos","tim cook","sundar pichai","mark Zukerberg","satya nadella"],"founded":[1994,1976,1998,2004,1975]}
v=pd.DataFrame(d)
v.sort_values("founded",ascending=False)

     company             CEO  founded
3   facebook  mark Zukerberg     2004
2     google   sundar pichai     1998
0     amazon       jef bezos     1994
1      apple        tim cook     1976
4  microsoft   satya nadella     1975

In [12]:
d={"company":["amazon","apple","google","facebook","microsoft"],"CEO":["jef bezos","tim cook","sundar pichai","mark Zukerberg","satya nadella"],"founded":[1994,1976,1998,2004,1975]}
v=pd.DataFrame(d)
v.index=[int(i) for i in range(1,6)]
print(v.size)
v.set_index("founded",inplace=False)

15

           company             CEO
founded
1994        amazon       jef bezos
1976         apple        tim cook
1998        google   sundar pichai
2004      facebook  mark Zukerberg
1975     microsoft   satya nadella

In [13]:
import pandas as pd
d={"company":["amazon","apple","google","facebook","microsoft"],"CEO":["jef bezos","tim cook","sundar pichai","mark Zukerberg","satya nadella"],"founded":[1994,1976,1998,2004,1975]}
v=pd.DataFrame(d)
v.replace("amazon","sdksj")

     company             CEO  founded
0      sdksj       jef bezos     1994
1      apple        tim cook     1976
2     google   sundar pichai     1998
3   facebook  mark Zukerberg     2004
4  microsoft   satya nadella     1975

In [14]:
import pandas as pd
d={"company":["amazon","apple","google",None,"microsoft"],"CEO":["jef bezos","tim cook","sundar pichai","mark Zukerberg","satya nadella"],"founded":[1994,1976,1998,2004,1975]}
v=pd.DataFrame(d)
v.isnull().sum()

company    1
CEO        0
founded    0
dtype: int64

In [15]:
import pandas as pd
d={"company":["amazon","apple","google","facebook","microsoft"],"CEO":["jef bezos","tim cook","sundar pichai","mark Zukerberg","satya nadella"],"founded":[1994,1976,1998,2004,1975]}
v=pd.DataFrame(d)
v.notnull()

   company   CEO  founded
0     True  True     True
1     True  True     True
2     True  True     True
3     True  True     True
4     True  True     True

In [16]:
import pandas as pd
d={"company":["amazon","apple","google","facebook","microsoft"],"CEO":["jef bezos","tim cook","sundar pichai","mark Zukerberg","satya nadella"],"founded":[1994,1976,1998,2004,1975]}
v=pd.DataFrame(d)
v.rename(index={"amazon":"hds"},inplace=True)
print(v)

     company             CEO  founded
0     amazon       jef bezos     1994
1      apple        tim cook     1976
2     google   sundar pichai     1998
3   facebook  mark Zukerberg     2004
4  microsoft   satya nadella     1975

In [17]:
import pandas as pd
d={"company":["amazon","apple","google","facebook","microsoft"],"CEO":["jef bezos","tim cook","sundar pichai","mark Zukerberg","satya nadella"],"founded":[1994,1976,1998,2004,1975]}
v=pd.DataFrame(d)
v.columns=["Company","ceo","Founded"]
print(v)

     Company             ceo  Founded
0     amazon       jef bezos     1994
1      apple        tim cook     1976
2     google   sundar pichai     1998
3   facebook  mark Zukerberg     2004
4  microsoft   satya nadella     1975

In [18]:
import pandas as pd
d={"company":["amazon","apple","google","facebook","microsoft"],"CEO":["jef bezos","tim cook","sundar pichai","mark Zukerberg","satya nadella"],"founded":[1994,1976,1998,2004,1975]}
v=pd.DataFrame(d)
v.rename({"company":"brand"},inplace=True)
print(v)

     company             CEO  founded
0     amazon       jef bezos     1994
1      apple        tim cook     1976
2     google   sundar pichai     1998
3   facebook  mark Zukerberg     2004
4  microsoft   satya nadella     1975

In [19]:
import pandas as pd
d={"company":["amazon","apple","google","facebook","microsoft"],"CEO":["jef bezos","tim cook","sundar pichai","mark Zukerberg","satya nadella"],"founded":[1994,1976,1998,2004,1975]}
v=pd.DataFrame(d)
v.drop("founded",axis=1)

     company             CEO
0     amazon       jef bezos
1      apple        tim cook
2     google   sundar pichai
3   facebook  mark Zukerberg
4  microsoft   satya nadella

In [20]:
import pandas as pd
d={"company":["amazon","apple","google","facebook","microsoft"],"CEO":["jef bezos","tim cook","sundar pichai","mark Zukerberg","satya nadella"],"founded":[1994,1976,1998,2004,1975]}
v=pd.DataFrame(d)
v["jan"]=v.eval("2021-founded")
print(v)

     company             CEO  founded  jan
0     amazon       jef bezos     1994   27
1      apple        tim cook     1976   45
2     google   sundar pichai     1998   23
3   facebook  mark Zukerberg     2004   17
4  microsoft   satya nadella     1975   46

In [21]:
import pandas as pd
d={"company":["amazon","apple","google","facebook","microsoft"],"CEO":["jef bezos","tim cook","sundar pichai","mark Zukerberg","satya nadella"],"founded":[1994,1976,1998,2004,1975]}
v=pd.DataFrame(d)
v["jan"]=v.eval("2021-founded")
print(v)

     company             CEO  founded  jan
0     amazon       jef bezos     1994   27
1      apple        tim cook     1976   45
2     google   sundar pichai     1998   23
3   facebook  mark Zukerberg     2004   17
4  microsoft   satya nadella     1975   46

In [22]:
import pandas as pd
d={"company":["amazon","apple","google","facebook","microsoft"],"CEO":["jef bezos","tim cook","sundar pichai","mark Zukerberg","satya nadella"],"founded":[1994,1976,1998,2004,1975]}
v=pd.DataFrame(d)
v["journy"]=v.eval("2021-founded")
v.describe()

           founded     journy
count     5.000000   5.000000
mean   1989.400000  31.600000
std      13.183323  13.183323
min    1975.000000  17.000000
25%    1976.000000  23.000000
50%    1994.000000  27.000000
75%    1998.000000  45.000000
max    2004.000000  46.000000

In [23]:
import pandas as pd
d={"company":["amazon","apple","google","facebook","microsoft"],"CEO":["jef bezos","tim cook","sundar pichai","mark Zukerberg","satya nadella"],"founded":[1994,1976,1998,2004,1975]}
v=pd.DataFrame(d)
v["journy"]=v.eval("2021-founded")
v.founded.max()
v.founded.min()
v.journy.min()

17

In [24]:
import pandas as pd
d={"company":["amazon","apple","google","facebook","microsoft"],"CEO":["jef bezos","tim cook","sundar pichai","mark Zukerberg","satya nadella"],"founded":[1994,1976,1998,2004,1975]}
v=pd.DataFrame(d)
v[v.index==1]

  company       CEO  founded
1   apple  tim cook     1976

In [25]:
import pandas as pd
d={"company":["amazon","apple","google","facebook","microsoft"],"CEO":["jef bezos","tim cook","sundar pichai","mark Zukerberg","satya nadella"],"founded":[1994,1976,1998,2004,1975]}
v=pd.DataFrame(d)

In [26]:
pd.Series({1:"a",2:"b"})

1    a
2    b
dtype: object

In [27]:
from platform import python_version
print(python_version())

3.7.4

In [28]:
import pandas as pd
import numpy as np
pd.Panel(np.random.rand(2,4,5))

C:\Users\hp\Anaconda3\lib\site-packages\ipykernel_launcher.py:3: FutureWarning: The Panel class is removed from pandas. Accessing it from the top-level namespace will also be removed in the next version
  This is separate from the ipykernel package so we can avoid doing imports until

TypeError: Panel() takes no arguments

In [ ]:
import pandas as pd
Data =[1, 3, 4, 5, 6, 2, 9]
s = pd.Series(Data)     
Index =['a', 'b', 'c', 'd', 'e', 'f', 'g']  
si = pd.Series(Data, Index)  
print(si)

In [30]:
d=["indore","bhopal","baitul","mp"]
a=["a","b","c","d"]
se=pd.Series(d)
s=pd.Series(d,a)
print(se)
print(s)

0    indore
1    bhopal
2    baitul
3        mp
dtype: object
a    indore
b    bhopal
c    baitul
d        mp
dtype: object

In [31]:
d=[{"indore":"bhopal"},"baitul","mp","up"]
a=["a","b","c","d"]
se=pd.Series(d)
s=pd.Series(d,a)
print(se)
print(s)

0    {'indore': 'bhopal'}
1                  baitul
2                      mp
3                      up
dtype: object
a    {'indore': 'bhopal'}
b                  baitul
c                      mp
d                      up
dtype: object

In [32]:
d={1:["a","v"],2:"b",3:"c",4:"d",5:"e"}
se=pd.Series(d)
print(se)

1    [a, v]
2         b
3         c
4         d
5         e
dtype: object

In [33]:
d={"a":[2,3,4],"b":[5,6,7],'c':[4,5,6]}
a=pd.DataFrame(d)
a.index=(int(i) for i in range(5,8))
print(a)

   a  b  c
5  2  5  4
6  3  6  5
7  4  7  6

In [34]:
import pandas as pd
d={"company":["amazon","apple","google","facebook","microsoft"],"CEO":["jef bezos","tim cook","sundar pichai","mark Zukerberg","satya nadella"],"founded":[1994,1976,1998,2004,1975]}
v=pd.DataFrame(d)
v.rename(columns={"company":"brand"},inplace=True)
print(v)

       brand             CEO  founded
0     amazon       jef bezos     1994
1      apple        tim cook     1976
2     google   sundar pichai     1998
3   facebook  mark Zukerberg     2004
4  microsoft   satya nadella     1975

In [35]:
d=[[1,2,3],[4,5,6],[7,8,9],[0,9,8]]
#df=pd.Series(d)
f=pd.DataFrame(d)
f.index=["a","b","c","d"]
f.columns=["p","q","r"]
print(f)
a=f[1:3]
print(a[["p","q"]])

   p  q  r
a  1  2  3
b  4  5  6
c  7  8  9
d  0  9  8
   p  q
b  4  5
c  7  8